src/cf/InformationRegisters/СостояниеБаттла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СостояниеБаттла</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерРаунда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Участники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Баттл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Баттлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостояниеБаттла/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Баттл, НомерРаунда, ТипСобытия, Участник, Задание) Экспорт
	
	ЗаписьНабора = РегистрыСведений.СостояниеБаттла.СоздатьМенеджерЗаписи();

	ЗаписьНабора.Период = ТекущаяДатаСеанса();
	ЗаписьНабора.Баттл = Баттл;               

	ЗаписьНабора.НомерРаунда = НомерРаунда;
	ЗаписьНабора.ТипСобытия = ТипСобытия;
	ЗаписьНабора.Участник = Участник;

	ЗаписьНабора.Задание = Задание;

	ЗаписьНабора.Записать(Истина);
	
КонецПроцедуры
